## $\color{blue}{\text{Introduction to Python Libraries.}}$

### $\text{What is library.}$

A Python **library** is a collection of related modules. It contains number of code that can be used frequently in various
programs.

**Library** is used to avoid code reusability and from complexity of coding.

$\text{Here some popular libraries will be discussed, which are used in machine learning and data Science}$

## $\color{blue}{\text{Data Analysis with Python}}$

*Python has vast number of libraries and packages that allows us to deal with all the stages in a typical data science project. Libraries for multiple purposes*

### $\text{For Data Acquisition}$

*For data acquisition we have liabraies such as* **scrappy, BeutifulSoup, Pandas, Numpy, Spacy**

### $\text{For Data Wrangling}$

*For data wrangling we have* **pandas**, and **numpy** that allow us to process, clean, and manipulate data****

### $\text{For Data Exploration}$

*For data exploration there are,* **matplotlib** and **Seaborn** *that have variety of functions*

### $\text{For Modeling}$

*For modeling there is* **scikit-learn** *to build powerful models for machine learning*

**TensorFlow** and **Keras** also provide tools and functions to build deep learning models

### $\text{For Visualization}$

*For visualization, there is **Bokeh** and **Scipy** *to build beautiful and powerful visulaization*

### Some Libraries which are used in AI and DataScince

#### 1) Pandas 
#### 2) Numpy
#### 3) Matplotlib
#### 4) TensorFlow
#### 5) Keras 
#### 6) Scikit-learn
#### 7) Scipy

## $\text{1. Pandas}$

**Pandas** *is a fast, flexible, powerful, and easy to use Open Source data analysis and manipulation tool.It stqnds for* **Panel Data** and **Pythom Data Analysis library***

*It is used for **loading, organizing, manipulating, modeling** and **analyzig** data in a dataset*

### $\text{Pandas is used to handle DataFrames}$

#### What is DataFrame?

*It is a data structure that organizes data into a table of rows and columns, just like a spreadsheet*

#### What is Data Structure?

*Organzing and storing data in specialized format in order to perform operations more effecently is knonwn as *data structures**

### It will need to install Pandas in jupyter notebook.
Every Library must be installed. Then it can be import.

#### $\text{Installing Pandas}$
Just perform the followings to install Pandas.

pip install pandas (in Anaconda Prompt)

********
        or
conda install pandas ((in Anaconda Prompt))

********
        or 
 In Jupter You can try
 
!pip install pandas

********
        or 
!conda install pandas

********

In [1]:
#!conda install pandas
#remove the comment to install pandas. As here it is already installed.

****Let's import pandas****

In [2]:
import pandas

****To check the version of your package/library****

In [3]:
print(pandas.__version__)

1.2.4

*To check function pandas has, **dir()** function is used.*

In [4]:
dir(pandas)

['BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_hashtable',
 '_is_numpy_dev',
 '_lib',
 '_libs',
 '_np_version_under1p17',
 '_np_version_under1p18',
 '_testing',
 '_tslib',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

### i. Pandas Series

**Pandas** *series is used to handle 1-dimentional data. Such as integers, floats, complex numbers, strings and other Python Objects*

*It is a 1D array that can handle data of any type****

*Just like a coloumn in a table*

#### $Syntax$

$\text{pandas.Series(data, index)}$

* data  ==> int, float,  complext numbers, list, tuple, dictionary, etc
* index ==> axis labels

* if data is an ndarray, then index must be of same length as data

**Importing pandas**

In [5]:
import pandas as pd

##### **Now, generating Pandas Series from list**

In [6]:
listt = [1,2,3,4,5,6,7,8]
print(listt)

[1, 2, 3, 4, 5, 6, 7, 8]

In [7]:
pan_ser = pd.Series(listt)
pan_ser

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [8]:
ser1  = pd.Series(listt, index = ['a', 'b', 'c', 'd','e', 'f', 'g','h'])
ser1

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

#### To get the first 2 elements of the series

In [9]:
ser1.head(2)

a    1
b    2
dtype: int64

#### We can Access values using indexing

In [10]:
ser1[0]

1

In [11]:
ser1[1]

2

In [12]:
ser1[0:2]

a    1
b    2
dtype: int64

In [13]:
ser1[3:5]

d    4
e    5
dtype: int64

#### geting value by slicing the index

In [14]:
ser1['a':'d']

a    1
b    2
c    3
d    4
dtype: int64

**Generating some random data and create a Series of them**

In [15]:
import random
l = []
k = 0
while k < 4:
    l.append(random.random())
    k += 1
else:
    print(f'Generated Data: {l}')

Generated Data: [0.6273326532283449, 0.15946613406049026, 0.23317638919395955, 0.9543545059017049]

In [16]:
s = pd.Series(l, index = ['a','b','c','d'])
print('Generated Series:')
print(s)

Generated Series:
a    0.627333
b    0.159466
c    0.233176
d    0.954355
dtype: float64

**pandas can automatically create index according to the length of our data like below**

* Any datatype can be passed as arguments to pandas series.

In [17]:
colors = ['green','white', 'red', 'yellow']

color_data = pd.Series(colors)
print(color_data)

0     green
1     white
2       red
3    yellow
dtype: object

*In the same way, data and index can independently be defined and can be passed to pandas series.*

****In the above example, we have used the occupation list as index of our pandas series****

#### Generating Series from Dictionaries
The key values will be assigned as index if index are not defined.

In [18]:
import pandas as pd

In [19]:
dictt = {'a': 'apple', 'b': 'ball', 'o': 'orange'}
print(pd.Series(dictt))

a     apple
b      ball
o    orange
dtype: object

#### ****If the keys are passed as the index?****

****It'll still consider the keys****

In [20]:
import pandas as pd

In [21]:
data_ind = pd.Series(dictt, index = ['a', 'b', 'o'])
print(data_ind)

a     apple
b      ball
o    orange
dtype: object

* if the index is other than the key value it will create an index in the series with NaN data.

In [22]:
di = pd.Series(dictt, index = ['a', 'b', 'o', 'd'])
di

a     apple
b      ball
o    orange
d       NaN
dtype: object

#### ****By changing the order of the key the corresponding value will also be changed accordingly?****

In [23]:
di = pd.Series(dictt, index = ['o', 'a', 'b'])
print(di)

o    orange
a     apple
b      ball
dtype: object

****If   index is greater than the len(dictionary)  , then the given index values will only be converted into pandas series****

In [24]:
di = pd.Series(dictt, index = {'a', 'b'})
print(di)

b     ball
a    apple
dtype: object

#### Generating Series from Scaler (int, float) will like be

In [25]:
pd.Series(100, index = ['a', 'b', 'c', 'd', 'e'])

a    100
b    100
c    100
d    100
e    100
dtype: int64

In [26]:
pd.Series(10.05, index = ['a', 'b', 'c', 'd', 'e'])

a    10.05
b    10.05
c    10.05
d    10.05
e    10.05
dtype: float64

****Series can also be given a name using 'name' parameter from Pandas Series****

In [27]:
name_ser = pd.Series(10.05, index = ['a', 'b', 'c', 'd', 'e'], name = 'Any name')
name_ser

a    10.05
b    10.05
c    10.05
d    10.05
e    10.05
Name: Any name, dtype: float64

****series can be renamed by using Series.rename() function****

In [28]:
name_ser.rename('your name')

a    10.05
b    10.05
c    10.05
d    10.05
e    10.05
Name: your name, dtype: float64

### Data Manipulation in Pandas Series

#### adding new, replacing old and changing the order etc can be performed on pandas series

### ii.  Pandas DataFrame

****DataFrame is a 2-dimentional data structure in the form of table****

* *2-dimentional: data in the form of rows, columns, (table, like excel sheet)*

* *DataFrames can also handle data of all types*

**It is like adding multiple pandas series.**

#### Syntax

$\text{pd.DataFrame(data, index, columns)}$

Where;
* **data** can be of any type like; int, float, complext numbers, list, tuple, dictionary, etc.
* **index** is the  row labels
* **column** is the column labels

#### DataFrame has following elements

**1. Data**

**2. Rows**

**3. Columns**

### Now creating a DataFrame

#### Example:

In [29]:
import pandas as pd

In [30]:
list1 = [1,2,3,4,5,6,7,8]
print(list1)
list_df = pd.DataFrame(list1)
list_df

[1, 2, 3, 4, 5, 6, 7, 8]

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8

#### Example 2:

In [31]:
strg= ['Country', 'Pakistan', 'City', 'Chitral', 'Attractive']
strg_df = pd.DataFrame(strg)
strg_df

            0
0     Country
1    Pakistan
2        City
3     Chitral
4  Attractive

**column name can be added to the DataFrame****

In [32]:
strg_df = pd.DataFrame(strg, columns = ['Location'])
strg_df

     Location
0     Country
1    Pakistan
2        City
3     Chitral
4  Attractive

## $\color{blue}{\text{Data Manipulation in Pandas (DataFrame)}}$

**Column Addition, Deletion, and Selection**

##### Adding a Column in DataFrame

****What if we want to add another column in a DataFrame?****

In [33]:
lisst = ['Cricket', 'Soccer', 'Tennis', 'Hockey','Volleyball', 'Table tennis', 'Basketball', 'Baseball']
strg_df = pd.DataFrame(lisst, columns = ['Sports'])
strg_df

         Sports
0       Cricket
1        Soccer
2        Tennis
3        Hockey
4    Volleyball
5  Table tennis
6    Basketball
7      Baseball

****Adding a column in a dataframe is the same as adding another key/value pair in dictionary****

In [34]:
strg_df['NoPl'] = ['11', '11', '02', '11','06','02','05','09']
print('After Addition')
strg_df

After Addition

         Sports NoPl
0       Cricket   11
1        Soccer   11
2        Tennis   02
3        Hockey   11
4    Volleyball   06
5  Table tennis   02
6    Basketball   05
7      Baseball   09

****We can also add column using insert() function****

In [35]:
strg_df.insert(loc=2, column = 'National Game of',value = ['England','Italy','Venezuela','Pakistan','Nepal',
                                                           'China','Serbia','USA'])
strg_df

         Sports NoPl National Game of
0       Cricket   11          England
1        Soccer   11            Italy
2        Tennis   02        Venezuela
3        Hockey   11         Pakistan
4    Volleyball   06            Nepal
5  Table tennis   02            China
6    Basketball   05           Serbia
7      Baseball   09              USA

* **loc:**  position, where new column to be inserted.

* **column:**  *is the name of the new column*

* **values:** *are the values that will be inserted in the new column*

#### In the same way, column can be deleted from the DataFrame

**del** *keyword is used to delete a colums from a DataFrame. which is simple and easiest way*

In [36]:
print('Before deleting')
strg_df

Before deleting

         Sports NoPl National Game of
0       Cricket   11          England
1        Soccer   11            Italy
2        Tennis   02        Venezuela
3        Hockey   11         Pakistan
4    Volleyball   06            Nepal
5  Table tennis   02            China
6    Basketball   05           Serbia
7      Baseball   09              USA

In [37]:
del strg_df['National Game of']
strg_df

         Sports NoPl
0       Cricket   11
1        Soccer   11
2        Tennis   02
3        Hockey   11
4    Volleyball   06
5  Table tennis   02
6    Basketball   05
7      Baseball   09

$\text{Other Methods of removing column from a DataFrame is pop() function and drop() function}$

#### Selecting a Column from a DataFrame

In [38]:
O = [1,3,5,7,9]
E = [2,4,6,8,10]
P = [2,3,5,7,11]
merger = list(zip(O,E,P))
merger

[(1, 2, 2), (3, 4, 3), (5, 6, 5), (7, 8, 7), (9, 10, 11)]

In [39]:
merg_df = pd.DataFrame(merger, index = [1,2,3,4,5], columns = ['Odd', 'Even', 'Prime'])
merg_df

   Odd  Even  Prime
1    1     2      2
2    3     4      3
3    5     6      5
4    7     8      7
5    9    10     11

**Specified column can be selected with its name**

In [40]:
merg_df['Odd']

1    1
2    3
3    5
4    7
5    9
Name: Odd, dtype: int64

In [41]:
merg_df['Even']

1     2
2     4
3     6
4     8
5    10
Name: Even, dtype: int64

In [42]:
merg_df['Prime']

1     2
2     3
3     5
4     7
5    11
Name: Prime, dtype: int64

### Another way of selecting columns

In [43]:
merg_df.Odd

1    1
2    3
3    5
4    7
5    9
Name: Odd, dtype: int64

In [44]:
merg_df.Even

1     2
2     4
3     6
4     8
5    10
Name: Even, dtype: int64

In [45]:
merg_df

   Odd  Even  Prime
1    1     2      2
2    3     4      3
3    5     6      5
4    7     8      7
5    9    10     11

****By making a function we can swap the columns****

In [46]:
def swap_columns(df, col1, col2):
    cols = list(df.columns)
    a, b = cols.index(col1), cols.index(col2)
    cols[b], cols[a] = cols[a], cols[b]
    df = df[cols]
    return df

****Swapping column 'Even' with column 'Prime'****

In [47]:
#swap_columns(mer_df,'Odd','Prime')
swap_columns(merg_df,'Even','Prime')

   Odd  Prime  Even
1    1      2     2
2    3      3     4
3    5      5     6
4    7      7     8
5    9     11    10

#### Further Operations

In [48]:
merg_df.columns[0:2]

Index(['Odd', 'Even'], dtype='object')

In [49]:
merg_df[merg_df.columns[1:]]

   Even  Prime
1     2      2
2     4      3
3     6      5
4     8      7
5    10     11

In [50]:
merg_df[merg_df.columns[0:2]]

   Odd  Even
1    1     2
2    3     4
3    5     6
4    7     8
5    9    10

#### Adding, taking difference, product, and division of column in dataframe

### Example

In [51]:
merg_df

   Odd  Even  Prime
1    1     2      2
2    3     4      3
3    5     6      5
4    7     8      7
5    9    10     11

In [52]:
merg_df['Sum'] = merg_df['Odd'] + merg_df['Even'] + merg_df['Prime']
merg_df

   Odd  Even  Prime  Sum
1    1     2      2    5
2    3     4      3   10
3    5     6      5   16
4    7     8      7   22
5    9    10     11   30

In [53]:
merg_df['Difference'] = merg_df['Odd'] - merg_df['Even'] - merg_df['Prime']
merg_df

   Odd  Even  Prime  Sum  Difference
1    1     2      2    5          -3
2    3     4      3   10          -4
3    5     6      5   16          -6
4    7     8      7   22          -8
5    9    10     11   30         -12

In [54]:
merg_df['Product'] = merg_df['Odd'] * merg_df['Even'] * merg_df['Prime']
merg_df

   Odd  Even  Prime  Sum  Difference  Product
1    1     2      2    5          -3        4
2    3     4      3   10          -4       36
3    5     6      5   16          -6      150
4    7     8      7   22          -8      392
5    9    10     11   30         -12      990

In [55]:
merg_df['Quotient'] = merg_df['Odd'] / merg_df['Even'] / merg_df['Prime']
merg_df

   Odd  Even  Prime  Sum  Difference  Product  Quotient
1    1     2      2    5          -3        4  0.250000
2    3     4      3   10          -4       36  0.250000
3    5     6      5   16          -6      150  0.166667
4    7     8      7   22          -8      392  0.125000
5    9    10     11   30         -12      990  0.081818

### $\text{Row Addition, Deletion and Selection}$

#### $\text{Adding Rows}$

* *'DataFrame.loc' function is used to manipulate rows*

* *Row can be added at specified index using the same method used for dictionaries*

In [56]:
merg_df

   Odd  Even  Prime  Sum  Difference  Product  Quotient
1    1     2      2    5          -3        4  0.250000
2    3     4      3   10          -4       36  0.250000
3    5     6      5   16          -6      150  0.166667
4    7     8      7   22          -8      392  0.125000
5    9    10     11   30         -12      990  0.081818

In [57]:
merg_df.loc[6] = [1,2,3,4,5,6,7]
merg_df

   Odd  Even  Prime  Sum  Difference  Product  Quotient
1    1     2      2    5          -3        4  0.250000
2    3     4      3   10          -4       36  0.250000
3    5     6      5   16          -6      150  0.166667
4    7     8      7   22          -8      392  0.125000
5    9    10     11   30         -12      990  0.081818
6    1     2      3    4           5        6  7.000000

**The values of one row can be assigned to another, like**

In [58]:
merg_df.loc[6] = merg_df.loc[5]
merg_df

   Odd  Even  Prime   Sum  Difference  Product  Quotient
1  1.0   2.0    2.0   5.0        -3.0      4.0  0.250000
2  3.0   4.0    3.0  10.0        -4.0     36.0  0.250000
3  5.0   6.0    5.0  16.0        -6.0    150.0  0.166667
4  7.0   8.0    7.0  22.0        -8.0    392.0  0.125000
5  9.0  10.0   11.0  30.0       -12.0    990.0  0.081818
6  9.0  10.0   11.0  30.0       -12.0    990.0  0.081818

#### $\text{Deleting a Row}$

*To delete a particular row* **drop()** *function is used*

In [59]:
print('Before deleting')
merg_df

Before deleting

   Odd  Even  Prime   Sum  Difference  Product  Quotient
1  1.0   2.0    2.0   5.0        -3.0      4.0  0.250000
2  3.0   4.0    3.0  10.0        -4.0     36.0  0.250000
3  5.0   6.0    5.0  16.0        -6.0    150.0  0.166667
4  7.0   8.0    7.0  22.0        -8.0    392.0  0.125000
5  9.0  10.0   11.0  30.0       -12.0    990.0  0.081818
6  9.0  10.0   11.0  30.0       -12.0    990.0  0.081818

In [60]:
print('After deleting the row')
merg_df.drop(6)

After deleting the row

   Odd  Even  Prime   Sum  Difference  Product  Quotient
1  1.0   2.0    2.0   5.0        -3.0      4.0  0.250000
2  3.0   4.0    3.0  10.0        -4.0     36.0  0.250000
3  5.0   6.0    5.0  16.0        -6.0    150.0  0.166667
4  7.0   8.0    7.0  22.0        -8.0    392.0  0.125000
5  9.0  10.0   11.0  30.0       -12.0    990.0  0.081818

#### $\text{Selecting a Row}$

**==>>** **A row can be selected by the same .loc method**

In [61]:
merg_df.loc[:1]

   Odd  Even  Prime  Sum  Difference  Product  Quotient
1  1.0   2.0    2.0  5.0        -3.0      4.0      0.25

In [62]:
merg_df.loc[3:3]

   Odd  Even  Prime   Sum  Difference  Product  Quotient
3  5.0   6.0    5.0  16.0        -6.0    150.0  0.166667

In [63]:
merg_df.loc[2:2]

   Odd  Even  Prime   Sum  Difference  Product  Quotient
2  3.0   4.0    3.0  10.0        -4.0     36.0      0.25

In [64]:
merg_df.loc[2:4]

   Odd  Even  Prime   Sum  Difference  Product  Quotient
2  3.0   4.0    3.0  10.0        -4.0     36.0  0.250000
3  5.0   6.0    5.0  16.0        -6.0    150.0  0.166667
4  7.0   8.0    7.0  22.0        -8.0    392.0  0.125000

## $\text{Some Useful Functions}$

In [65]:
strg_df

         Sports NoPl
0       Cricket   11
1        Soccer   11
2        Tennis   02
3        Hockey   11
4    Volleyball   06
5  Table tennis   02
6    Basketball   05
7      Baseball   09

### i. head()

**head()** function is used to check the type of the data in the DataFrame. This helps to show few rows of the datafram. By defalt it shows first five rows of the dataframe.

In [66]:
strg_df.head()   # the argument inside the head() function determines, how many values we want to see
                  # 3 here indicates, we are printing first 3 rows of our data

       Sports NoPl
0     Cricket   11
1      Soccer   11
2      Tennis   02
3      Hockey   11
4  Volleyball   06

In [67]:
strg_df.head(2)

    Sports NoPl
0  Cricket   11
1   Soccer   11

### ii. tail()

**tail()** *Views Last Few Elements from the DataFrame*

In [68]:
strg_df.tail(2)   # the argument inside the tail() function determines, how many values we want to see

       Sports NoPl
6  Basketball   05
7    Baseball   09

### iii.  index

****To check name of the rows, we'll use .index method****

In [69]:
strg_df

         Sports NoPl
0       Cricket   11
1        Soccer   11
2        Tennis   02
3        Hockey   11
4    Volleyball   06
5  Table tennis   02
6    Basketball   05
7      Baseball   09

In [70]:
strg_df.index

RangeIndex(start=0, stop=8, step=1)

### iv. columns

*To check the name of the columns in a DataFrame*

In [71]:
strg_df

         Sports NoPl
0       Cricket   11
1        Soccer   11
2        Tennis   02
3        Hockey   11
4    Volleyball   06
5  Table tennis   02
6    Basketball   05
7      Baseball   09

In [72]:
strg_df.Sports

0         Cricket
1          Soccer
2          Tennis
3          Hockey
4      Volleyball
5    Table tennis
6      Basketball
7        Baseball
Name: Sports, dtype: object

### v. count()

From Pandas **.count()** *is used to find number of elements in dataframe*

In [73]:
strg_df.count()

Sports    8
NoPl      8
dtype: int64

### vi.  mean()

**mean()** *function is used to find average value of all the columns*

In [74]:
strg_df.NoPl.mean()

138877638252563.62

****To find mean value of a specific column****

### vi. describe()

**describe()** *function computes a variety of summary statistics about a dataframe*
*It also give us an idea how our variable are distributed*

In [75]:
stats = strg_df.describe()
stats

          Sports NoPl
count          8    8
unique         8    5
top     Baseball   11
freq           1    3

### vii.  shape

**shape** is an important attribute which gives us the dimensions of data (number of rows and columns)*

In [76]:
strg_df.shape

(8, 2)

### viii. info()

**info()** function gives important details regarding a dataset*

*such as, number of rows, and columns, type of data, number of non null values, memory consumption etc*

In [77]:
strg_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sports  8 non-null      object
 1   NoPl    8 non-null      object
dtypes: object(2)
memory usage: 256.0+ bytes

**info()** *should be the very first command, after importing or uploading a dataset*

### ix. append()

**append()** function is very useful function for appending datasets.

In [78]:
a = [1,2,3,4,5,6,7] # where 'a' is a list.

In [79]:
a.append(5)
a

[1, 2, 3, 4, 5, 6, 7, 5]

### x.  isnull()

**In most of the case dataset has many missing values. These missing values are identified in the form of 'NaN' values (Not a Number)**

*In this situation pandas built-in function **isnull()** comes very useful for removing these NaN values*

In [80]:
strg_df

         Sports NoPl
0       Cricket   11
1        Soccer   11
2        Tennis   02
3        Hockey   11
4    Volleyball   06
5  Table tennis   02
6    Basketball   05
7      Baseball   09

In [81]:
strg_df.isnull()

   Sports   NoPl
0   False  False
1   False  False
2   False  False
3   False  False
4   False  False
5   False  False
6   False  False
7   False  False

*In the above dataframe, false means, there is no missing value.*

In [82]:
strg_df['Fans_billion'] = pd.Series(data = [2.5, 4])
strg_df

         Sports NoPl  Fans_billion
0       Cricket   11           2.5
1        Soccer   11           4.0
2        Tennis   02           NaN
3        Hockey   11           NaN
4    Volleyball   06           NaN
5  Table tennis   02           NaN
6    Basketball   05           NaN
7      Baseball   09           NaN

In [83]:
strg_df.isnull()

   Sports   NoPl  Fans_billion
0   False  False         False
1   False  False         False
2   False  False          True
3   False  False          True
4   False  False          True
5   False  False          True
6   False  False          True
7   False  False          True

* Notice isnull() returns a DataFrame of two values, either 'True' or 'False'

* True repesents it has a missing values

* While False represents it doesn't

**Total number of missing values in each column can be found $sum()$ funtion.**

In [84]:
strg_df.isnull().sum()

Sports          0
NoPl            0
Fans_billion    6
dtype: int64

**There are 6 missing values in 4th columns Fans_billion.**

### xi. fillna()

****The proces of replacing all the missing values from the dataset by some other value is known as imputation****

****Imputation is a feature engineering technique to keep data that has missing values****

****Usually we replace NaN value with either mean value of the column or median value but we can always replace it with a value of our choice****

In [85]:
strg_df

         Sports NoPl  Fans_billion
0       Cricket   11           2.5
1        Soccer   11           4.0
2        Tennis   02           NaN
3        Hockey   11           NaN
4    Volleyball   06           NaN
5  Table tennis   02           NaN
6    Basketball   05           NaN
7      Baseball   09           NaN

****All the missing values will be replaced from the last column with 1.5. mostly it is repalced with the average value of that column****

In [86]:
filled_df = strg_df.fillna(1.5)
filled_df

         Sports NoPl  Fans_billion
0       Cricket   11           2.5
1        Soccer   11           4.0
2        Tennis   02           1.5
3        Hockey   11           1.5
4    Volleyball   06           1.5
5  Table tennis   02           1.5
6    Basketball   05           1.5
7      Baseball   09           1.5

**Filling with the average value of the columns**

In [87]:
fill_avg = strg_df.fillna(strg_df["Fans_billion"].mean())
fill_avg

         Sports NoPl  Fans_billion
0       Cricket   11          2.50
1        Soccer   11          4.00
2        Tennis   02          3.25
3        Hockey   11          3.25
4    Volleyball   06          3.25
5  Table tennis   02          3.25
6    Basketball   05          3.25
7      Baseball   09          3.25

### xiii. loc

**loc** is used to locate rows by name.

In [88]:
strg_df

         Sports NoPl  Fans_billion
0       Cricket   11           2.5
1        Soccer   11           4.0
2        Tennis   02           NaN
3        Hockey   11           NaN
4    Volleyball   06           NaN
5  Table tennis   02           NaN
6    Basketball   05           NaN
7      Baseball   09           NaN

In [89]:
list_df = [1,2,3,4,5,6,7,8]
df_list = pd.DataFrame(list_df)
df_list

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8

In [90]:
df_1 = df_list.rename(index = {0: 'a', 1 : 'b', 2 : 'c', 3: 'c', 4: 'd', 5: 'e', 6: 'f'})
df_1

   0
a  1
b  2
c  3
c  4
d  5
e  6
f  7
7  8

In [91]:
df_1.loc['b']

0    2
Name: b, dtype: int64

In [92]:
df_1.loc['b': 'd']

   0
b  2
c  3
c  4
d  5

In [93]:
df_1.loc[:'c'] # select rows form index 'a' to 'c'

   0
a  1
b  2
c  3
c  4

### xiv. iloc

**iloc** is used to locate/find rows using their index number

In [94]:
df_1.iloc[3]

0    4
Name: c, dtype: int64

In [95]:
print(df_1.iloc[1:3])

   0
b  2
c  3

### xv. Correlation (corr())

**Correlation** is a statistical method used to find relationship between two features/variables of a dataset.

*There are 3 types of correlation*

* *1) Positive Correlation*

* *2) Negative Correlation*

* *3) Zero Correlation*

##### corr() function can be used like:

In [96]:
df_1.corr()

     0
0  1.0

****The calue of correlation lies between 1 and -1****

* 1 implies positive correlation.
* -1 implies negatice correlation.
* whereas 0 implies no correlation,

e.g Height and Weight are psotively correlated

**Note:**

**=>** Close to 1 means, the values are in good relationship, quantities have directly relation*

**=>** Close to -1 also means, if one if the value increase the other decreases, e.g Height above sea level and temprature negative correlated*

**=>** 0 or close 0 means the values are independent of each other, increae in one doesnot effect the other, e.g age and name are zero correlated*

### xvi.  reindexing ()

* Renaming the row and cloumn labels is called reindexing

In [97]:
filled_df

         Sports NoPl  Fans_billion
0       Cricket   11           2.5
1        Soccer   11           4.0
2        Tennis   02           1.5
3        Hockey   11           1.5
4    Volleyball   06           1.5
5  Table tennis   02           1.5
6    Basketball   05           1.5
7      Baseball   09           1.5

In [98]:
reindexed = filled_df.reindex(index = [0,1,2], columns = ['Games', 'Playars','Populirity'])
reindexed

   Games  Playars  Populirity
0    NaN      NaN         NaN
1    NaN      NaN         NaN
2    NaN      NaN         NaN

### xvii. Iteration

**Iteration** over a DataFrame gives column names

In [99]:
filled_df

         Sports NoPl  Fans_billion
0       Cricket   11           2.5
1        Soccer   11           4.0
2        Tennis   02           1.5
3        Hockey   11           1.5
4    Volleyball   06           1.5
5  Table tennis   02           1.5
6    Basketball   05           1.5
7      Baseball   09           1.5

**To iterate Over Column Names**

In [100]:
for column in filled_df:
    print(column)

Sports
NoPl
Fans_billion

**To Iterate Over Rows using iterrows()**

*Iteration over rows in a DataFrame yield row names along with the series of values in the rows*

In [101]:
for rows in filled_df.iterrows():
    print(rows)

(0, Sports          Cricket
NoPl                 11
Fans_billion        2.5
Name: 0, dtype: object)
(1, Sports          Soccer
NoPl                11
Fans_billion       4.0
Name: 1, dtype: object)
(2, Sports          Tennis
NoPl                02
Fans_billion       1.5
Name: 2, dtype: object)
(3, Sports          Hockey
NoPl                11
Fans_billion       1.5
Name: 3, dtype: object)
(4, Sports          Volleyball
NoPl                    06
Fans_billion           1.5
Name: 4, dtype: object)
(5, Sports          Table tennis
NoPl                      02
Fans_billion             1.5
Name: 5, dtype: object)
(6, Sports          Basketball
NoPl                    05
Fans_billion           1.5
Name: 6, dtype: object)
(7, Sports          Baseball
NoPl                  09
Fans_billion         1.5
Name: 7, dtype: object)

#### Iterating Over Rows and Columns (iteritems())

*Iteration over a DataFrame values yield key,value pairs*

*Column is considered as key, while all the elements inside a column are returned as values*

In [102]:
for row, column in filled_df.iteritems():
    print(row, column)

Sports 0         Cricket
1          Soccer
2          Tennis
3          Hockey
4      Volleyball
5    Table tennis
6      Basketball
7        Baseball
Name: Sports, dtype: object
NoPl 0    11
1    11
2    02
3    11
4    06
5    02
6    05
7    09
Name: NoPl, dtype: object
Fans_billion 0    2.5
1    4.0
2    1.5
3    1.5
4    1.5
5    1.5
6    1.5
7    1.5
Name: Fans_billion, dtype: float64

#### Iterating Over a DataFrame as Tuple (itertuples())

Iteration over a DataFrame as tuple will give a series of tuples, where the first element of the tuple will be the index value, while the remaining elements will be the row values

In [103]:
for tup in filled_df.itertuples():
    print(tup)

Pandas(Index=0, Sports='Cricket', NoPl='11', Fans_billion=2.5)
Pandas(Index=1, Sports='Soccer', NoPl='11', Fans_billion=4.0)
Pandas(Index=2, Sports='Tennis', NoPl='02', Fans_billion=1.5)
Pandas(Index=3, Sports='Hockey', NoPl='11', Fans_billion=1.5)
Pandas(Index=4, Sports='Volleyball', NoPl='06', Fans_billion=1.5)
Pandas(Index=5, Sports='Table tennis', NoPl='02', Fans_billion=1.5)
Pandas(Index=6, Sports='Basketball', NoPl='05', Fans_billion=1.5)
Pandas(Index=7, Sports='Baseball', NoPl='09', Fans_billion=1.5)

### xviii. Sorting

*Sorting means putting all the elements of a sequence in an order*

#### $\text{There are two types of sorting in Pandas}$

**1. Sorting by Label**

****2. Sorting by Actual Value****

*Using random module from Python to generate random data*

In [104]:
import random
a = []
b = []
for i in range(5):
    rnd1 = random.randint(-3,3)
    rnd2 = random.randint(-5,5)
    a.append(rnd1)
    b.append(rnd2)
data = list(zip(a,b))
print(data)

[(2, -2), (-2, -2), (0, -3), (-1, -1), (1, 1)]

In [105]:
print(a)
print(b)

[2, -2, 0, -1, 1]
[-2, -2, -3, -1, 1]

In [106]:
new_data = pd.DataFrame(data, index = [3,1,5,4,2], columns = ['list_a', 'list_b'])
new_data

   list_a  list_b
3       2      -2
1      -2      -2
5       0      -3
4      -1      -1
2       1       1

****Notice how our data is unordered (look at the indexes!)****

#### $\color{blue}{\text{1. Sorting by Label}}$

**Sorting by label** means rearranging all the elements of a sequence/list/DataFrame etc, with respect to their indexes

In [107]:
print('DataFrame before sorting')
new_data

DataFrame before sorting

   list_a  list_b
3       2      -2
1      -2      -2
5       0      -3
4      -1      -1
2       1       1

**pd.sort_index()**

In [108]:
sorted = new_data.sort_index()
print('DataFrame after sorting')
sorted

DataFrame after sorting

   list_a  list_b
1      -2      -2
2       1       1
3       2      -2
4      -1      -1
5       0      -3

#### The order can be set by sorting either ascending, or descending .

In [109]:
new_data

   list_a  list_b
3       2      -2
1      -2      -2
5       0      -3
4      -1      -1
2       1       1

In [110]:
new_data.sort_index(ascending = True)

   list_a  list_b
1      -2      -2
2       1       1
3       2      -2
4      -1      -1
5       0      -3

In [111]:
new_data.sort_index(ascending = False)

   list_a  list_b
5       0      -3
4      -1      -1
3       2      -2
2       1       1
1      -2      -2

#### $\color{blue}{\text{2. Sorting by Value}}$

*Simply adding axis = 1 for sorting columns*

****Data can be sorted by using values, for this we'll use $\color{blue}{\text{sort.value()}}$ function from pandas****

* **sort.values()** function accepts an argument 'by'.

* 'by' argument will accept the column name with which, the data is to be sorted.

In [112]:
new_data

   list_a  list_b
3       2      -2
1      -2      -2
5       0      -3
4      -1      -1
2       1       1

In [113]:
new_data.sort_values(by = 'list_a')

   list_a  list_b
1      -2      -2
4      -1      -1
5       0      -3
2       1       1
3       2      -2

### xix. groupby()

*Pandas **groupby()** function is used to split the data into groups having similar characteristics, applying functions to them, and returning the result accordingly*

*It is used to split DataFrame into smaller groups, applying some analysis on the groups and then accumulating the results accordingly*

*It is same as splitting a problem into smaller smaller sub-problems and then solving each sub-problem, it makes our analysis easy and fast*

In [114]:
employee = {'Name': ['Imtiaz', 'Wasim', 'Faruq', 'Sajad', 'Asif'],

           'Department': ['Administration', 'Marketing', 'Technical', 'Planning', 'Designing'],

           'Employment Type': ['full_time', 'contract', 'Intern', 'Part-time', 'Part-time'],

           'Salary': [50000, 25000, 10000, 20000, 20000],

           'Experience (years)': [3, 1, 0, 1,1]}

In [115]:
data_em = pd.DataFrame(employee)
data_em

     Name      Department Employment Type  Salary  Experience (years)
0  Imtiaz  Administration       full_time   50000                   3
1   Wasim       Marketing        contract   25000                   1
2   Faruq       Technical          Intern   10000                   0
3   Sajad        Planning       Part-time   20000                   1
4    Asif       Designing       Part-time   20000                   1

****Here we are grouping our data based on Department****

In [116]:
grouped =  data_em.groupby('Department')
grouped

**In order to get the data based on the groups made, .get_group() function from pandas is used to get the data based on the columns selected**

****Since, the grouped data is based on department, So, getting data based on different departments****

*Getting data for Technical Department*

In [117]:
grouped.get_group('Technical')

    Name Department Employment Type  Salary  Experience (years)
2  Faruq  Technical          Intern   10000                   0

****Getting data for Marketing Department****

In [118]:
grouped.get_group('Marketing')

    Name Department Employment Type  Salary  Experience (years)
1  Wasim  Marketing        contract   25000                   1

****Getting data for Administration Department****

In [119]:
grouped.get_group('Administration')

     Name      Department Employment Type  Salary  Experience (years)
0  Imtiaz  Administration       full_time   50000                   3

##### Department Vs Salary

In [120]:
ds = data_em.groupby(['Department', 'Salary'])
print(ds.groups)

{('Administration', 50000): [0], ('Designing', 20000): [4], ('Marketing', 25000): [1], ('Planning', 20000): [3], ('Technical', 10000): [2]}

In [121]:
data_em.groupby('Department')['Salary'].mean()

Department
Administration    50000
Designing         20000
Marketing         25000
Planning          20000
Technical         10000
Name: Salary, dtype: int64

In [122]:
grouping = data_em.groupby(['Department', 'Salary', 'Experience (years)'])
print(ds.groups)

{('Administration', 50000): [0], ('Designing', 20000): [4], ('Marketing', 25000): [1], ('Planning', 20000): [3], ('Technical', 10000): [2]}

In [123]:
data_em.groupby('Department')['Salary', 'Experience (years)'].mean()

<ipython-input-123-820ab998853e>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  data_em.groupby('Department')['Salary', 'Experience (years)'].mean()

                Salary  Experience (years)
Department
Administration   50000                   3
Designing        20000                   1
Marketing        25000                   1
Planning         20000                   1
Technical        10000                   0

### $\text{Input/Output Tools}$

* *Pandas allows to read/write easily different file formats*

* *Pandas can load a variety of files into its dataframe. For instance, cvs, excel, text, XML etc*

###  Lets importing file a CSV File

In [124]:
import pandas as pd

#### Importing csv file

In [125]:
data = pd.read_csv('train.csv')

In [126]:
data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In the next repository, some preprocesing and ploting will be done on this dataset

### $\text{Thank You}$